Documents/ВыплатыПоДоговорамОпеки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ВыплатыПоДоговорамОпеки</Name>
			<BasedOn>
				<xr:Item>Catalog.Сотрудники</xr:Item>
				<xr:Item>Document.ВыплатыПоДоговорамОпеки</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.УсловияДоговораОпеки</xr:Item>
				<xr:Item>InformationRegister.УсловияВыплатПоДоговоруОпеки</xr:Item>
				<xr:Item>InformationRegister.ПериодыДействияДоговоровГражданскоПравовогоХарактера</xr:Item>
				<xr:Item>InformationRegister.МероприятияТрудовойДеятельности</xr:Item>
				<xr:Item>InformationRegister.ПараметрыПериодовСтажаПФР</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОтраженияЗарплатыВБухучете</Name>
					<Comment>АПК:58 Способ отражения описывает счет и субконто</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВБухУчете</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяФинансирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиФинансированияЗарплата</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиРасходовЗарплата</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВычета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьРуководителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПодписиРуководителя</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПодписи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Территория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТерриторииВыполненияРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаПФР</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияДохода</Name>
					<Comment>АПК:58 имя ВидДохода уже занято</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.КатегорииДоходовНДФЛ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучаетСтраховуюПенсию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОблагаетсяФСС_НС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтразитьТрудовуюДеятельность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКЗ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЗанятий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Выплаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторВыплаты</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ребенок</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РодственникиФизическихЛиц</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыплачиваетсяПриВозрастеОт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыплачиваетсяПриВозрастеДо</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособРасчета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыРасчетаВыплатПоДоговорамОпеки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрожиточныйМинимум</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПрожиточныеМинимумы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсключаяДатуОт</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВключаяДатуДо</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/УсловияДоговораОпеки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>УсловияДоговораОпеки</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КодДохода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДоходовНДФЛ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодВычета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыВычетовНДФЛ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодДоходаСтраховыеВзносы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДоходовПоСтраховымВзносам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатьяФинансирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиФинансированияЗарплата</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиРасходовЗарплата</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОтраженияЗарплатыВБухучете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВБухУчете</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВычета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Территория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТерриторииВыполненияРабот</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КатегорияДохода</Name>
					<Comment>АПК:58 имя ВидДохода уже занято</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.КатегорииДоходовНДФЛ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолучаетСтраховуюПенсию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВыплатыПоДоговорамОпеки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ВыплатыПоДоговорамОпеки/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ЗарплатаКадры.ПроверитьКорректностьДаты(Ссылка, ДатаНачала, "Объект.ДатаНачала", Отказ, НСтр("ru='Дата начала'"), , , Ложь);
	ВыплатыПоДоговорамОпеки.ПроверитьДатаОкончанияНеМеньшеДатыНачала(ДатаНачала, ДатаОкончания, ЭтотОбъект, "ДатаОкончания", Отказ);
	Если Не ОтразитьТрудовуюДеятельность Тогда
		ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("КодПоОКЗ"));
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Сотрудники") Тогда
		ЗарплатаКадры.ЗаполнитьПоОснованиюСотрудником(ЭтотОбъект, ДанныеЗаполнения, , Истина)
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВыплатыПоДоговорамОпеки") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, , "Номер,Дата");
		Для Каждого СтрокаДокументаИсточника Из ДанныеЗаполнения.Выплаты Цикл 
			НоваяСтрока = Выплаты.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДокументаИсточника, , "ИдентификаторВыплаты");
			НоваяСтрока.ИдентификаторВыплаты = Новый УникальныйИдентификатор;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	ДанныеДляПроведения = ДанныеДляПроведения();
	
	Для Каждого УсловияДоговора Из ДанныеДляПроведения.УсловияДоговора Цикл 
		Движения.УсловияДоговораОпеки.Записывать = Истина;
	    НоваяСтрока = Движения.УсловияДоговораОпеки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, УсловияДоговора);
		НоваяСтрока.Период = УсловияДоговора.ДатаНачала;
	КонецЦикла;
	
	УсловияВыплат = ДанныеДляПроведения.УсловияВыплат;
	Для Каждого Строка Из УсловияВыплат Цикл
		Движения.УсловияВыплатПоДоговоруОпеки.Записывать = Истина;
	    НоваяСтрока = Движения.УсловияВыплатПоДоговоруОпеки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		НоваяСтрока.Период = ДатаНачала;
	КонецЦикла;
	
	КадровыйУчет.СформироватьДвиженияДоговоровГПХ(Движения, ДанныеДляПроведения.ПериодыДействияДоговоровГражданскоПравовогоХарактера);
	УчетСтажаПФР.ЗарегистрироватьПериодыВУчетеСтажаПФР(Движения, ДанныеДляРегистрацииВУчетаСтажаПФР());
	
	ЭлектронныеТрудовыеКнижки.СформироватьДвиженияМероприятийТрудовойДеятельности(
		Движения.МероприятияТрудовойДеятельности,
		ДанныеДляПроведения.МероприятияТрудовойДеятельности);

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбменДанными

Функция СовместноРегистрируемыеОбъекты() Экспорт
	Возврат ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Сотрудник);
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Получает данные для формирования движений.
// Возвращает таблицу значений - данные, необходимые для формирования плановых начислений по договорам.
//
Функция ДанныеДляПроведения()
	
	ДатаВыделенияДоходовПоДоговоруОпеки = УчетНДФЛ.ДатаВыделенияДоходовПоДоговоруОпеки();
	
	ДатаАктуальности = ДатаВыделенияДоходовПоДоговоруОпеки;
	
	ВидДохода = УчетНДФЛ.ВидДоходаПоДоговоруОпеки(ДатаАктуальности);
	ВидВычета = УчетНДФЛ.ВидВычетаПоДоговоруОпеки(ДатаАктуальности);
	
	Если ПолучаетСтраховуюПенсию Тогда
		КодДоходаСтраховыеВзносы = ?(ОблагаетсяФСС_НС, 
		ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыДоходовПоСтраховымВзносам.ВыплатыПоДоговорамОпекиПолучающимСтраховыеПенсииОблагаемыеФСС_НС"),
		ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыДоходовПоСтраховымВзносам.ВыплатыПоДоговорамОпекиПолучающимСтраховыеПенсии"));
	Иначе 
		КодДоходаСтраховыеВзносы = УчетСтраховыхВзносов.ВидДоходаДляДоговораНаВыполнениеРабот(ОблагаетсяФСС_НС);
	КонецЕсли;
	
	ВсеУсловияДоговора = Новый Массив;

	УсловияДоговора = Новый Структура;
	УсловияДоговора.Вставить("Организация", Организация);
	УсловияДоговора.Вставить("Сотрудник", Сотрудник);
	УсловияДоговора.Вставить("ФизическоеЛицо", ФизическоеЛицо);
	УсловияДоговора.Вставить("Договор", Ссылка);
	УсловияДоговора.Вставить("КодДохода", УчетНДФЛ.ВидДоходаПоДоговоруОпеки(ДатаНачала));
	УсловияДоговора.Вставить("КодВычета", УчетНДФЛ.ВидВычетаПоДоговоруОпеки(ДатаНачала));
	УсловияДоговора.Вставить("КодДоходаСтраховыеВзносы", КодДоходаСтраховыеВзносы);
	УсловияДоговора.Вставить("СпособОтраженияЗарплатыВБухучете", СпособОтраженияЗарплатыВБухучете);
	УсловияДоговора.Вставить("СтатьяФинансирования", СтатьяФинансирования);
	УсловияДоговора.Вставить("СтатьяРасходов", СтатьяРасходов);
	УсловияДоговора.Вставить("Подразделение", Подразделение);
	УсловияДоговора.Вставить("СуммаВычета", СуммаВычета);
	УсловияДоговора.Вставить("ДатаНачала", ДатаНачала);
	УсловияДоговора.Вставить("ДатаОкончания", ДатаОкончания);
	УсловияДоговора.Вставить("Территория", Территория);
	УсловияДоговора.Вставить("КатегорияДохода", КатегорияДохода);
	УсловияДоговора.Вставить("ПолучаетСтраховуюПенсию", ПолучаетСтраховуюПенсию);
	Если ДатаНачала<ДатаВыделенияДоходовПоДоговоруОпеки И ДатаВыделенияДоходовПоДоговоруОпеки<=ДатаОкончания Тогда // Надо делить.
		НачальныеУсловияДоговора = Новый ФиксированнаяСтруктура(УсловияДоговора);
		СтарыеУсловияДоговора = Новый Структура(НачальныеУсловияДоговора);
		СтарыеУсловияДоговора.ДатаОкончания = НачалоДня(НачалоДня(ДатаВыделенияДоходовПоДоговоруОпеки)-1);
		ВсеУсловияДоговора.Добавить(СтарыеУсловияДоговора);
		НовыеУсловияДоговора = Новый Структура(НачальныеУсловияДоговора);
		НовыеУсловияДоговора.ДатаНачала = ДатаВыделенияДоходовПоДоговоруОпеки;
		НовыеУсловияДоговора.КодДохода = УчетНДФЛ.ВидДоходаПоДоговоруОпеки(ДатаВыделенияДоходовПоДоговоруОпеки);
		НовыеУсловияДоговора.КодВычета = УчетНДФЛ.ВидВычетаПоДоговоруОпеки(ДатаВыделенияДоходовПоДоговоруОпеки);
		ВсеУсловияДоговора.Добавить(НовыеУсловияДоговора);
	Иначе 
		ВсеУсловияДоговора.Добавить(УсловияДоговора);
	КонецЕсли;
	
	ДанныеДляПроведения = Новый Структура;
	ДанныеДляПроведения.Вставить("УсловияДоговора", ВсеУсловияДоговора);
	
	УсловияВыплат = Новый Массив;
	
	Дети = Новый Массив;
	Для Каждого СтрокаВыплаты Из Выплаты Цикл 
		Если ЗначениеЗаполнено(СтрокаВыплаты.Ребенок) И Дети.Найти(СтрокаВыплаты.Ребенок)=Неопределено Тогда 
			Дети.Добавить(СтрокаВыплаты.Ребенок);
		КонецЕсли;
	КонецЦикла;
	ДатыРождения = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(Дети, "ДатаРождения");
	
	Для Каждого СтрокаВыплаты Из Выплаты Цикл 
		
		Если ЗначениеЗаполнено(СтрокаВыплаты.Ребенок) Тогда 
			ДатаРождения = ДатыРождения.Получить(СтрокаВыплаты.Ребенок);
		Иначе 
			ДатаРождения = Неопределено;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДатаРождения) Тогда 
			Если СтрокаВыплаты.ВыплачиваетсяПриВозрастеОт>0 Тогда 
				ДатаНачалаВыплаты = ДобавитьМесяц(ДатаРождения, СтрокаВыплаты.ВыплачиваетсяПриВозрастеОт);
				Если СтрокаВыплаты.ИсключаяДатуОт Тогда 
					ДатаНачалаВыплаты = ДатаНачалаВыплаты + 24*60*60;
				КонецЕсли;
				Если ДатаНачалаВыплаты < ДатаНачала Тогда 
					ДатаНачалаВыплаты = ДатаНачала;
				КонецЕсли;
			Иначе 
				ДатаНачалаВыплаты = ДатаНачала;
			КонецЕсли;
			
			Если СтрокаВыплаты.ВыплачиваетсяПриВозрастеДо>0 Тогда 
				ДатаОкончанияВыплаты = ДобавитьМесяц(НачалоДня(НачалоДня(ДатаРождения)-1), СтрокаВыплаты.ВыплачиваетсяПриВозрастеДо);
				Если СтрокаВыплаты.ВключаяДатуДо Тогда 
					ДатаОкончанияВыплаты = ДатаОкончанияВыплаты + 24*60*60;
				КонецЕсли;
				Если ДатаОкончанияВыплаты > ДатаОкончания Тогда 
					ДатаОкончанияВыплаты = ДатаОкончания;
				КонецЕсли;
			Иначе 
				ДатаОкончанияВыплаты = ДатаОкончания;
			КонецЕсли;

		Иначе 
			ДатаНачалаВыплаты = ДатаНачала;
			ДатаОкончанияВыплаты = ДатаОкончания;
		КонецЕсли;
		
		
		Если ДатаОкончанияВыплаты<ДатаНачалаВыплаты Тогда 
			Продолжить;
		КонецЕсли;
		
		ПараметрыВыплаты = Новый Структура;
		ПараметрыВыплаты.Вставить("Договор", Ссылка);
		ПараметрыВыплаты.Вставить("ИдентификаторВыплаты", СтрокаВыплаты.ИдентификаторВыплаты);
		ПараметрыВыплаты.Вставить("ДатаНачала", ДатаНачалаВыплаты);
		ПараметрыВыплаты.Вставить("ДатаОкончания", ДатаОкончанияВыплаты);
		ПараметрыВыплаты.Вставить("СпособРасчета", СтрокаВыплаты.СпособРасчета);
		ПараметрыВыплаты.Вставить("ПрожиточныйМинимум", СтрокаВыплаты.ПрожиточныйМинимум);
		ПараметрыВыплаты.Вставить("Размер", СтрокаВыплаты.Размер);
		ПараметрыВыплаты.Вставить("Коэффициент", СтрокаВыплаты.Коэффициент);
		ПараметрыВыплаты.Вставить("Наименование", СтрокаВыплаты.Наименование);
		ПараметрыВыплаты.Вставить("Ребенок", СтрокаВыплаты.Ребенок);
		УсловияВыплат.Добавить(ПараметрыВыплаты);
	КонецЦикла;
	
	ДанныеДляПроведения.Вставить("УсловияВыплат", УсловияВыплат);
	
	ПериодыДействияДоговоровГражданскоПравовогоХарактера = Новый Структура;
	ПериодыДействияДоговоровГражданскоПравовогоХарактера.Вставить("Организация", Организация);
	ПериодыДействияДоговоровГражданскоПравовогоХарактера.Вставить("Филиал", Организация);
	ПериодыДействияДоговоровГражданскоПравовогоХарактера.Вставить("Сотрудник", Сотрудник);
	ПериодыДействияДоговоровГражданскоПравовогоХарактера.Вставить("ФизическоеЛицо", ФизическоеЛицо);
	ПериодыДействияДоговоровГражданскоПравовогоХарактера.Вставить("ДатаНачала", ДатаНачала);
	ПериодыДействияДоговоровГражданскоПравовогоХарактера.Вставить("ДатаОкончания", ДатаОкончания);
	ПериодыДействияДоговоровГражданскоПравовогоХарактера.Вставить("Подразделение", Подразделение);
	ПериодыДействияДоговоровГражданскоПравовогоХарактера.Вставить("Территория", Территория);
	
	ДанныеДляПроведения.Вставить("ПериодыДействияДоговоровГражданскоПравовогоХарактера",
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПериодыДействияДоговоровГражданскоПравовогоХарактера));
	
	ДанныеДляПроведения.Вставить("МероприятияТрудовойДеятельности",
		Документы.ВыплатыПоДоговорамОпеки.ДанныеДляПроведенияМероприятияТрудовойДеятельности(Ссылка).Получить(Ссылка));
	
	Возврат ДанныеДляПроведения;
	
КонецФункции

Функция ДанныеДляРегистрацииВУчетаСтажаПФР()
	МассивСсылок = Новый Массив;
	МассивСсылок.Добавить(Ссылка);
	
	ДанныеДляРегистрации = Документы.ВыплатыПоДоговорамОпеки.ДанныеДляРегистрацииВУчетаСтажаПФР(МассивСсылок);
	
	Возврат ДанныеДляРегистрации[Ссылка];
	
КонецФункции

Процедура ПриКопировании(ОбъектКопирования)
	Для Каждого СтрокаВыплат Из Выплаты Цикл 
		СтрокаВыплат.ИдентификаторВыплаты = Новый УникальныйИдентификатор;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
